# 浅拷贝:创建一个新的外层容器，但内部的元素还是指向原来的对象
# 浅拷贝缺点：对于嵌套可变对象时，嵌套数据还是跟原来的共享，修改时会互相影响
import copy

nums = [10, 203, 405, 560, [20, 30, 40]]
nums_copy = copy.copy(nums)
nums_copy[4][0] = 50
print(nums_copy)        # [10, 203, 405, 560, [50, 30, 40]]
print(nums)             # [10, 203, 405, 560, [50, 30, 40]] 原数据被修改

# 深拷贝：创建一个新的外层容器，并对其内部所有【可变子对象】进行递归复制
# 1、深拷贝可以彻底消除数据之间的影响
# 2、遇到不可变对象时，不会复制，直接引用
# 3、元组中没有可变对象时，不会使用深拷贝
nums_deepcopy = copy.deepcopy(nums)
nums_deepcopy[4][0] = 80
print(nums_deepcopy)    # [10, 203, 405, 560, [80, 30, 40]]
print(nums)             # [10, 203, 405, 560, [50, 30, 40]] 没有对原数据 修改